thesnowpear/kitchen-agent-based-on-esp32s3/sdkconfig.defaults
# ESP32-S3-DevKitC-1 N8R8: 8MB Flash + 8MB PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# 使用自定义 8MB 分区表：大主固件 + 小 recovery、本地资源分区和 coredump。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_recovery.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_recovery.csv"

# OTA 启动状态：主固件运行在 ota_0，小型 recovery 运行在 ota_1。
# 注意：一大一小后不能再把云端恢复当唯一兜底；recovery 必须保留本地串口/联网恢复入口。
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_ROLLBACK_ENABLE=y

# N8R8 模组常见为 8MB Octal PSRAM；保守使用 80MHz，不启用 120MHz 实验频率。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# 现场调试保留 brownout 和 flash coredump，方便定位供电、看门狗和堆栈问题。
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# 当前阶段默认进入 USB/Web 运维模式，确保 get_status、get_sensors 和网络配置面板可直接工作。
CONFIG_FRIDGE_SCREEN_TEST=n
CONFIG_FRIDGE_SCREEN_TEST_PCLK_HZ=10000000
CONFIG_FRIDGE_SCREEN_TEST_COLOR_HOLD_MS=3000
CONFIG_FRIDGE_SCREEN_TEST_REPORT_EVERY_CYCLES=10
# CONFIG_FRIDGE_SCREEN_TEST_VERBOSE_LOG is not set
CONFIG_FRIDGE_CAMERA_TEST=n
CONFIG_FRIDGE_CAMERA_XCLK_HZ=10000000
CONFIG_FRIDGE_CAMERA_PREVIEW_MAX_BYTES=65536

# 当前传感器、触摸和 USB I2C 调试路径仍使用 ESP-IDF legacy I2C。
# esp32-camera 的 SCCB 也必须走 legacy 驱动，避免 IDF6 启动期检测到新旧 I2C 混用后 abort。
CONFIG_SCCB_HARDWARE_I2C_DRIVER_LEGACY=y
# CONFIG_SCCB_HARDWARE_I2C_DRIVER_NEW is not set
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=16384

# AI API 测试使用 HTTPS 与系统证书包，不额外在固件中硬编码服务商证书。
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ESP-SR WakeNet：第一版只加载官方“小滨小滨/小冰小冰”唤醒词模型。
# 模型烧录到 partitions_recovery.csv 中固定 label=model 的分区，不启用 MultiNet 命令词。
CONFIG_MODEL_IN_FLASH=y
CONFIG_AFE_INTERFACE_V1=y
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y
CONFIG_SR_WN_WN9_XIAOBINXIAOBIN_TTS=y
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y

# 本地 720x720 LVGL UI。首版使用局部刷新行缓冲，绘图内存优先走 PSRAM。
CONFIG_FRIDGE_UI_ENABLE=y
CONFIG_LV_COLOR_DEPTH_16=y
# LVGL 默认内置 malloc 会在 .dram0.bss 放静态内存池；ESP32-S3 上会挤压内部 SRAM。
# 改用 C 库 malloc，让 LVGL 小对象走 ESP-IDF heap，行缓冲仍由 UI 组件显式放到 PSRAM。
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_BUILTIN_MALLOC=n
CONFIG_LV_USE_PERF_MONITOR=n

# 固件只使用项目自建页面，不编译 LVGL examples/demo，减少镜像体积和静态 RAM 占用。
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_KEYPAD_AND_ENCODER=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_RENDER=n
CONFIG_LV_USE_DEMO_SCROLL=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_TRANSFORM=n
CONFIG_LV_USE_DEMO_MUSIC=n
CONFIG_LV_USE_DEMO_FLEX_LAYOUT=n
CONFIG_LV_USE_DEMO_MULTILANG=n
CONFIG_LV_USE_DEMO_VECTOR_GRAPHIC=n

# 默认构建完整主固件。需要生成 ota_1 小型兜底固件时，临时打开该项并执行 reconfigure build。
CONFIG_FRIDGE_RECOVERY_APP=n
